{
  "latte": "Creamy double-shot espresso with steamed milk and a touch of microfoam.",
  "espresso": "Rich, concentrated single-origin espresso pulled to perfection.",
  "cappuccino": "Equal parts espresso, steamed milk, and airy foam—classic balance.",
  "iced-coffee": "Slow-chilled brewed coffee poured over ice, crisp and refreshing.",
  "americano": "Espresso topped with hot water for a smooth, long cup.",
  "mocha": "Chocolate-kissed latte with whipped cream on request.",
  "cold-brew": "20-hour cold steep for smooth, low-acidity coffee.",

  "green-tea": "Light, grassy, and antioxidant-rich whole-leaf infusion.",
  "black-tea": "Robust, malty cup—excellent with a splash of milk.",
  "herbal-tea": "Caffeine-free botanicals; soothing and aromatic.",
  "chai-latte": "Masala spices simmered with tea and milk; gently sweet.",
  "masala-chai": "Bold Indian spiced tea brewed strong with milk.",
  "iced-tea": "House-brewed tea served chilled; sweetened or unsweetened.",

  "croissant": "Buttery, flaky layers baked fresh every morning.",
  "muffin": "Seasonal flavors—blueberry, banana-walnut, and more.",
  "scone": "Crumbly and rich; ask for jam and butter.",
  "danish-pastry": "Laminated dough with rotating fruit or cream-cheese fillings.",
  "banana-bread": "Moist loaf with ripe bananas; toasted on request.",
  "chocolate-eclair": "Choux pastry filled with vanilla custard, topped with chocolate.",

  "avocado-toast": "Sourdough, smashed avocado, lemon, seeds, and chili flakes.",
  "breakfast-sandwich": "Egg, cheddar, and choice of bacon or mushrooms on brioche.",
  "yogurt-parfait": "Greek yogurt, seasonal fruit, and crunchy granola layers.",
  "oatmeal": "Hearty oats with honey; add-ons: nuts, seeds, berries.",

  "pumpkin-spice-latte": "Autumn spices with pumpkin purée and velvety milk.",
  "peppermint-mocha": "Chocolate and peppermint with espresso and milk—holiday favorite.",
  "gingerbread-cookie": "Spiced cookie with molasses and a soft bite.",
  "eggnog-latte": "Holiday classic—espresso with creamy eggnog and nutmeg."
}
